Revit 2027 API
Parameter.AsDouble Method
Provides access to the double precision number within the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AsDouble()
Public Function AsDouble As Double
public:
double AsDouble()
member AsDouble : unit -> float
Return Value
Double
The double value contained in the parameter.
Remarks
The AsDouble method should only be used if the StorageType property returns that the internal contents of the parameter is a double.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace